{"keras_version": "2.0.4", "backend": "tensorflow", "config": [{"config": {"trainable": true, "use_bias": true, "activity_regularizer": null, "kernel_regularizer": null, "batch_input_shape": [null, 28, 28, 1], "filters": 32, "kernel_size": [3, 3], "name": "conv2d_1", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_last", "activation": "relu", "bias_constraint": null, "padding": "valid", "kernel_constraint": null, "strides": [1, 1], "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "dtype": "float32", "bias_regularizer": null}, "class_name": "Conv2D"}, {"config": {"use_bias": true, "activity_regularizer": null, "kernel_regularizer": null, "trainable": true, "filters": 64, "kernel_size": [3, 3], "name": "conv2d_2", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_last", "activation": "relu", "bias_constraint": null, "padding": "valid", "kernel_constraint": null, "strides": [1, 1], "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "bias_regularizer": null}, "class_name": "Conv2D"}, {"config": {"data_format": "channels_last", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "trainable": true, "name": "max_pooling2d_1"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "rate": 0.25, "name": "dropout_1"}, "class_name": "Dropout"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"units": 128, "use_bias": true, "kernel_regularizer": null, "trainable": true, "activity_regularizer": null, "name": "dense_1", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "bias_constraint": null, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "bias_regularizer": null}, "class_name": "Dense"}, {"config": {"trainable": true, "rate": 0.5, "name": "dropout_2"}, "class_name": "Dropout"}, {"config": {"units": 10, "use_bias": true, "kernel_regularizer": null, "trainable": true, "activity_regularizer": null, "name": "dense_2", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "softmax", "bias_constraint": null, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "bias_regularizer": null}, "class_name": "Dense"}], "class_name": "Sequential"}